// ---
// 1. $F(n) = \sum\limits_{x=1}^{n}x*2^x$\\
// 错位相减，直接求出答案 $F(n)=(n-1)*2^{n+1}+2$。\\
// \\
// 2. $F(n) = \sum\limits_{x=1}^{n}2^x*x^2$\\
// 先构造 $f(x)=\sum\limits_{i=1}^{n}x^i*i^2$，即直接求出$x$的通式，然后再将$x$替换成$2$。\\
// 利用高数计算无穷级数的方法，先构造$\frac{f(x)}{x}$，然后先积分再求导，得出答案 $F(n)=2^{n+1}*(n^2-2*n+3)-6$。\\
// \\
// 3. 常见组合数公式\\
// $\sum_{i=1}^n{2^ii^2} = (n^2-2n+3)2^{n+1} - 6$\\
// \\
// $\sum_{i=1}^{n}2^ii = (n-1)2^{n+1} + 2$\\
// \\
// $1^2+2^2+3^2+\cdots+n^2 = \frac{n(n+1)(2*n+1)}{6}$\\
// \\
// $1^3+2^3+3^3+\cdots+n^3 = \frac{n^2(n+1)^2}{4}$\\
// \\
// $\sum_{i=0}^{k}C_{n+i}^{n} = C_{n+k+1}^{n+1}$\\
// \\
// $\sum_{i=1}^{n}iC_{n}^{i}=n*2^{n-1}$\\
// \\
// $\sum_{i=1}^{n}i^2C_{n}^{i}=n*(n+1)*2^{n-2}$\\
// \\
// $\sum_{i=1}^{n}(-1)^{i-1}\frac{C_{n}^{i}}{i}=\sum_{i=1}^{n}\frac{1}{i}$\\
// \\
// $\sum_{i=0}^{n}(C_{n}^{i})^2=C_{2n}^{n}$\\
// ---
return 0;